---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.Insert(Autodesk.Revit.DB.DetailCurve,System.Int32)
source: html/0f607036-f66c-fab4-dbff-b20a116599df.htm
---
# Autodesk.Revit.DB.DetailCurveArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	DetailCurve item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.DetailCurve`)
- **index** (`System.Int32`)